/*
 * These translations are the the "Santa Scan" app.
 *
 * A demo video can be found at http://youtu.be/RoaJ1QdzHS8 .
 * The video can provide some context.
 */

/*
 * App Name
 *
 * In this case, "Scan" refers to looking or searching for something, suggesting
 * the use of a gadget or device to assist in the search.
 */
"APP_NAME" = "Espion Noël";

/*
 * Status messages
 *
 * These are status messages to be displayed at the top of the app in a
 * limited-space area.  There is only room for up to about 3 words.
 */

// Looking/searching for Santa
"STATUS_SCANNING" = "Balayage...";

// Almost found Santa, about to "lock" onto him
"STATUS_LOCKING" = "Verrouillage...";

// No camera was foud on the phone
"CAMERA_PREVIEW_VIDEO_NOT_CONNECTED" = "Pas de caméra";

// Had an error trying to access the camera on the phone
"CAMERA_VIEW_ERROR" = "Erreur de caméra";

// Had an error trying to play a sound on the phone
"AUDIO_INIT_ERROR" = "Erreur de son";

// Had an error trying to use the compass on the phone
"SENSOR_ERROR_CANT_FIND_NORTH" = "Erreur de compas";

// Need an upgrade ot the iPhone software to use this app
"IOS_NEEDS_UPGRADE" = "Mettre à jour IOS";

// No compass was found on the phone
"SENSOR_ERROR_MAGNETOMETER_NOT_AVAILABLE" = "Pas de compas";

// Had an error trying to find the user's location, such as with GPS
"LOCATION_ERROR" = "Erreur d'emplacement";

"FILE_ERROR" = "Erreur de fichier";

"INTENAL_ERROR" = "Internal error";

/*
 * Misc labels for buttons, etc.
 */

"MILES_SHORT" = "miles";

"KILOMETERS_SHORT" = "km";

// For a button that leads to a help page
"HELP" = "Aide";

// For a button that leads to social sharing options
"SHARE" = "Partager";


/*
 * Social messages
 */

// The first %@ is a number of miles or kilometers, and
// the second %@ is the name of the app (Santa Scan).
// This is used to encourage other people to get the app.
"SHARE_TEXT" = "J'ai trouvé Père Noël à partir de %@. http://goo.gl/DdOJB5 #apps #iPhone #santarts";

"RTS_NEWS_DEFAULT_TEXT" = "Nous espérons que vous appréciez l'application!";

/*
 * New COPPA-related text
 */
"PARENT_GATE_INSTRUCTIONS" = "Pour plus d'aide et d'info, maintenez deux doigts sur l'écran pendant plusieurs secondes à n'importe quel moment.";

"PRIVACY_POLICY_LABEL" = "Protection de la Vie Privée";

"LOCATION_EXPLANATION" = "Pour déterminer l'itinéraire vers le Père Noël, cette appli a besoin d'une adresse approximative.\
\
Conformément aux lois relatives à la protection de l'enfance, cette appli ne peut pas détecter votre adresse exacte. A la place, vous pouvez indiquer une ville, un pays, une région, ou un code postal.";

"NETWORK_ERROR_LABEL" = "Erreur de Réseau";

"NETWORK_ERROR_MESSAGE" = "Merci de réessayer dans quelques instants ou de vérifier vos paramètres réseau.\
\
L'accès au réseau est nécessaire pour vous localiser.";

"LOCATION_PROMPT" = "Où êtes-vous (approx.) ?";

"CITY_STATE_ETC" = "Ville, région, pays, etc.";

"DONE_LABEL" = "Terminé";

"CANCEL_LABEL" = "Annuler";

"DEFAULT_LOC_NAME" = "Définir votre position";

"SET_LOCATION_TEXT" = "Voulez-vous entrer dans votre ville ou l'Etat pour une meilleure distance et la direction de Père Noël?";

"NO_THANKS" = "Non";

"OKAY" = "Ok";

"SET_LOCATION_LATER_TEXT" = "Votre distance et la direction de Santa seront basés sur l'emplacement par défaut. Vous pouvez entrer votre propre emplacement à tout moment en cliquant sur le bouton «i» en bas de l'écran.";

/*
 * Web links - *** No translation needed below here ***
 */

// Default news link, used if the above link cannot be reached
"RTS_NEWS_DEFAULT_LINK" = "http://goo.gl/DdOJB5";

// App app home page
"APP_HOME_URL" = "http://translate.google.com/translate?hl=en&sl=en&tl=fr&u=http%3A%2F%2Fwww.roundtripsoftware.com%2Fapp%2Fsanta%2F";

// App help page
"APP_HELP_URL" = "http://translate.google.com/translate?sl=en&tl=fr&js=n&prev=_t&hl=en&ie=UTF-8&u=http%3A%2F%2Fwww.roundtripsoftware.com%2Fhelp%2Fsanta%2F&act=url";

// RTS home page
"RTS_HOME_URL" = "http://translate.google.com/translate?hl=en&sl=en&tl=fr&u=http%3A%2F%2Fwww.roundtripsoftware.com%2F";

// Downloads the latest new from RTS, to embed in the flip side view
"RTS_NEWS_TEXT_SOURCE" = "http://goo.gl/eKqJWa";

// This link conttains the App Store link to hit when the news above is clicked
"RTS_NEWS_LINK_SOURCE" = "http://www.roundtripsoftware.com/app_news/link_fr.txt";
// So the URL above will return a link such as below when available:

"APP_PRIVACY_POLICY_URL" = "http://translate.google.com/translate?hl=en&sl=en&tl=fr&u=http%3A%2F%2Fwww.privacychoice.org%2Fpolicy%2Ftext%3Fpolicy%3Ddf32b1f28302e7d1ca0887ea017f166d";
